{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-04-25T02:12:18.2851117Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-04-25T02:12:18.2851117Z","name":"JoeLoveless - Windows LAPS","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":7,"technologies":"mdm","id":"413b3d2b-6c44-4e89-9ade-b64d810890a4","templateReference":{"templateId":"adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1","templateFamily":"endpointSecurityAccountProtection","templateDisplayName":"Local admin password solution (Windows LAPS)","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_backupdirectory","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a3270f64-e493-499d-8900-90290f61ed8a"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_backupdirectory_1","settingValueTemplateReference":{"settingValueTemplateId":"4d90f03d-e14c-43c4-86da-681da96a2f92","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passwordagedays_aad","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":30}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_administratoraccountname","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d3d7d492-0019-4f56-96f8-1967f7deabeb"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","value":"joeadmin","settingValueTemplateReference":{"settingValueTemplateId":"992c7fce-f9e4-46ab-ac11-e167398859ea","useTemplateDefault":false}}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passwordcomplexity","settingInstanceTemplateReference":{"settingInstanceTemplateId":"8a7459e8-1d1c-458a-8906-7b27d216de52"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_passwordcomplexity_8","settingValueTemplateReference":{"settingValueTemplateId":"aa883ab5-625e-4e3b-b830-a37a4bb8ce01","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passphraselength","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":9}}]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passwordlength","settingInstanceTemplateReference":{"settingInstanceTemplateId":"da7a1dbd-caf7-4341-ab63-ece6f994ff02"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":14,"settingValueTemplateReference":{"settingValueTemplateId":"d08f1266-5345-4f53-8ae1-4c20e6cb5ec9","useTemplateDefault":false}}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_postauthenticationactions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d9282eb1-d187-42ae-b366-7081f32dcfff"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_postauthenticationactions_11","settingValueTemplateReference":{"settingValueTemplateId":"68ff4f78-baa8-4b32-bf3d-5ad5566d8142","useTemplateDefault":false},"children":[]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_postauthenticationresetdelay","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a9e21166-4055-4042-9372-efaf3ef41868"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":4,"settingValueTemplateReference":{"settingValueTemplateId":"0deb6aee-8dac-40c4-a9dd-c3718e5c1d52","useTemplateDefault":false}}}},{"id":"6","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_automaticaccountmanagementenabled","settingInstanceTemplateReference":{"settingInstanceTemplateId":"0d70f6fb-8f35-4fba-8ada-494b8a478703"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_automaticaccountmanagementenabled_false","settingValueTemplateReference":{"settingValueTemplateId":"5db30960-1e02-4100-9e2c-a2212596b054","useTemplateDefault":false},"children":[]}}}]}